Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The range is limited to that of the device running the server, such that if the device has an IP of 92.168.11.130, then the data will be broadcast over the range 92.168.11.*.
zh_cn: 该范围被限制在运行服务器的设备的范围内，例如，如果该设备的IP为92.168.11.130，那么数据将在92.168.11.*范围内广播。

source: The raw byte value.
zh_cn: 原始字节值。

source: The real number to be turned into a string.
zh_cn: 要转换成字符串的实数。

source: The real value to write to the file.
zh_cn: 写入文件的实际值。

source: The real value to write to the relevant destination.
zh_cn: 写入相关目的地的实际值。

source: The red component of the colour
zh_cn: 颜色的红色成分

source: The reference value for a struct or array to convert into a JSON string
zh_cn: 要转换为JSON字符串的结构或数组的参考值

source: The release of a touch/click from a drag had enough movement for a flick event to be detected anywhere in the room
zh_cn: 从拖动中释放触摸/点击具有足够的移动，使得在房间的任何地方都可以检测到轻击事件

source: The release of a touch/click from a drag had enough movement for a flick event to be detected for the instance
zh_cn: 对于该实例，从拖动释放触摸/点击具有足够的移动来检测轻击事件

source: The release of one (or both) touches for a pinch has been detected anywhere in the room
zh_cn: 在房间的任何地方都可以检测到释放一次(或两次)挤压触摸

source: The release of one (or both) touches for a pinch has been detected for an instance
zh_cn: 对于一个实例，已经检测到挤压的一个(或两个)触摸的释放

source: The release of one (or both) touches for a rotation has been detected anywhere in the room
zh_cn: 在房间的任何地方都检测到释放一个(或两个)旋转触摸

source: The release of one (or both) touches for a rotation has been detected for an instance
zh_cn: 对于实例，已检测到旋转的一次(或两次)触摸的释放

source: The release of the touch/click from a drag has been detected anywhere in the room
zh_cn: 在房间的任何地方都检测到了从拖动释放触摸/点击

source: The release of the touch/click from a drag has been detected for an instance
zh_cn: 对于一个实例，已经检测到从拖动中释放触摸/点击

source: The render target index to check (from 0 to 3).
zh_cn: 要检查的渲染目标索引(从0到3)。

source: The render target index to use (from 0 to 3).
zh_cn: 要使用的呈现目标索引(从0到3)。

source: The request method (normally "POST" or "GET", but all methods are supported)
zh_cn: 请求方法(通常是"POST"或"GET"，但支持所有方法)

source: The resolution value supplied in the argument needs to be in milliseconds.
zh_cn: 参数中提供的分辨率值需要以毫秒为单位。

source: The rest of the arguments are the same as those used for normal sprite drawing and will change the scale, angle, blend colour and alpha of the final animation frame being drawn.
zh_cn: 其余的参数与用于正常精灵绘制的参数相同，并将改变所绘制的最终动画帧的比例、角度、混合颜色和alpha。

source: The restitution of the fixture (usually between 0 and 1)
zh_cn: 夹具的恢复(通常在0和1之间)

source: The return code of the application, will defaul to 0.
zh_cn: 应用程序的返回代码将默认为0。

source: The return value can be an object index, an instance ID or -1 if no follow target has been set.
zh_cn: 返回值可以是对象索引、实例ID或-1(如果没有设置follow target)。

source: The return value is a string, which will be the name of the set as you defined it in your skeletal animation program.
zh_cn: 返回值是一个字符串，它将是您在框架动画程序中定义的集合的名称。

source: The return value is always positive and will be a whole number.
zh_cn: 返回值总是正的，并且将是一个整数。

source: The return value is in seconds.
zh_cn: 返回值以秒为单位。

source: The return value will be between 0 and 360.
zh_cn: 返回值将在0到360之间。

source: The return value will be in pixels per game frame.
zh_cn: 返回值将以每帧游戏的像素为单位。

source: The return value will be in pixels.
zh_cn: 返回值将以像素为单位。

source: The return value will be one of the following constants:
zh_cn: 返回值将是以下常量之一:

source: The return value will between 0 and 1 and shows how "smooth" the edges of these sprites will be drawn.
zh_cn: 返回值将介于 0 和 1 之间，并显示这些精灵的边缘将如何"平滑"绘制。

source: The return value will change during the draw event when you have various views as the draw event is called once for each view port in succession.
zh_cn: 当您拥有不同的视图时，返回值将在绘制事件期间发生变化，因为绘制事件将连续为每个视图端口调用一次。

source: The return value will depend on the type of data that you are reading, which in itself is defined by the following constants:
zh_cn: 返回值将取决于您正在读取的数据类型，数据类型本身由以下常量定义:

source: The returned array will have 4 elements:
zh_cn: 返回的数组将包含4个元素:

source: The returned value will be between -1 and 1 for each of the available horizontal and vertical axes.
zh_cn: 对于每个可用的水平轴和垂直轴，返回值将介于-1和1之间。

source: The returned value will be one of the following constants (the default value is bm_normal):
zh_cn: 返回值将是下列常量之一(默认值为bm_normal):

source: The returned value will be one of the following constants (the default value is cull_noculling):
zh_cn: 返回值将是下列常量之一(默认值为cull_noculling):

source: The returned value will range between 1 and 16.
zh_cn: 返回值将介于1和16之间。

source: The returning index should be stored in a variable to be used in all further functions that are used to define and use this fixture.
zh_cn: 返回索引应该存储在一个变量中，以便用于定义和使用该夹具的所有进一步函数中使用。

source: The right cell column of the region.
zh_cn: 区域的右侧单元格列。

source: The right edge of the rectangle to check
zh_cn: 要检查的矩形的右边缘

source: The right edge slice
zh_cn: 切片右边边缘

source: The right mouse button
zh_cn: 鼠标右键

source: The right position of the region of cells to copy from the source grid.
zh_cn: 要从源网格复制的单元格区域的正确位置。

source: The right side of the bounding box
zh_cn: 边界框的右侧

source: The right stick pressed (as a button)
zh_cn: 按下右边的操纵杆(作为按钮)

source: The room to target for all further layer functions
zh_cn: 房间的目标是所有进一步层的函数

source: The rotation of the image.
zh_cn: 图像的旋转。

source: The rotation of the image: 0 = normal, 90 = turned 90° counter-clockwise etc.
zh_cn: 图像的旋转: 0 = 正常，90 = 逆时针旋转90°等。

source: The rotation of the sprite.
zh_cn: 精灵的旋转。

source: The rotation or angle to draw the surface with.
zh_cn: 绘制表面所用的旋转或角度。

source: The rotation or angle to draw the surface.
zh_cn: 绘制表面的旋转或角度。

source: The same goes for the sub-image, as this can also be set to the instance variable image_index which will set the sub-image to that selected for the current instance sprite (note, that you can draw a different sprite and still use the sub-image value for the current instance), or you can use any other value for this to draw a specific sub-image of the chosen sprite.
zh_cn: 子图像也是如此，因为它也可以设置为实例变量 image_index，它将子图像设置为为当前实例精灵选择的子图像（注意，您可以绘制不同的精灵并仍然使用子-当前实例的图像值），或者您可以使用任何其他值来绘制所选精灵的特定子图像。

source: The sample rate of the data in the buffer queue.
zh_cn: 缓冲队列中数据的采样率。

source: The sample rate of the data in the buffer.
zh_cn: 缓冲区中数据的采样率。

source: The sampler id from the shader.
zh_cn: 着色器中的采样器id。

source: The scale factor to apply to the sprite along the x axis.
zh_cn: 沿x轴应用于精灵的缩放倍数。

source: The scale factor to apply to the sprite along the y axis.
zh_cn: 沿y轴应用于精灵的缩放倍数。

source: The scale factor to use (1, no scale, 2, half scale, 4, quarter scale, etc...)
zh_cn: 使用的缩放乘数(1、无缩放、2、缩放一半、4、缩放到四分之一，等等)

source: The scale of the icon (default 1).
zh_cn: 图标的比例(默认为1)。

source: The scale value to use (1 is no scaling)
zh_cn: 要使用的缩放值(1表示无缩放)

source: The scale value you give is a multiplier that will be used to change the way the background element is displayed, where a value of 0.5 would display the element at half scale, and a value of 2 would display at double scale.
zh_cn: 您给定的比例值是一个乘数，将用于更改背景元素的显示方式，其中值0.5将以一半比例显示元素，值2将以两倍比例显示元素。

source: The scaling factor to be applied to gravity for all particles.
zh_cn: 应用于所有粒子重力的缩放倍数。

source: The score to be sent.
zh_cn: 要发送的分数。

source: The score to beat.
zh_cn: 要打破的记录。

source: The script function index to assign to the layer (or -1)
zh_cn: 要分配给层的脚本函数索引(或-1)

source: The script function to run each game frame
zh_cn: 运行每个游戏帧的脚本函数

source: The script to run each game frame
zh_cn: 每个游戏帧运行的脚本

source: The second angle to use.
zh_cn: 第二个角度。

source: The second colour the blend will take from.
zh_cn: 混合的第二种颜色。

source: The second colour to merge
zh_cn: 要合并的第二种颜色

source: The second input value.
zh_cn: 第二个输入值。

source: The second instance to connect with the joint
zh_cn: 用关节连接的第二个实例

source: The second matrix index to use.
zh_cn: 第二个要使用的矩阵索引。

source: The second particle group to join.
zh_cn: 要加入的第二个粒子组。

source: The second texture coordinate to use (0 - 1).
zh_cn: 要使用的第二个纹理坐标(0 - 1)。

source: The second to check.
zh_cn: 第二个检查。

source: The second to set.
zh_cn: 要设置的秒钟。

source: The second value.
zh_cn: 第二个值。

source: The second x coordinate for the joint, within the game world
zh_cn: 游戏世界中关节的第二个x坐标

source: The second x coordinate.
zh_cn: 第二个x坐标。

source: The second y coordinate.
zh_cn: 第二个y坐标。

source: The section in the open .ini file to check a key in.
zh_cn: 检查打开的.ini文件的节下的键

source: The section in the open .ini file to check for.
zh_cn: 打开的 .ini 文件中要检查的部分。

source: The section of the .ini to read from.
zh_cn: 要从.ini读取的节。

source: The section of the .ini to write to.
zh_cn: 要写入的 .ini 节。

source: The section to delete a key from.
zh_cn: 要从中删除键的部分。

source: The section to delete.
zh_cn: 要删除的部分。

source: The seed to set.
zh_cn: 要设定的种子。

source: The select button (on a DS4 controller, this triggers when you press the touchpad down)
zh_cn: 选择按钮(在DS4控制器上，当你按下触摸板时触发)

source: The selection coordinates are based on the absolute size of the display (or window if not fullscreen), so (0,0) is always the top left hand corner of the screen (or window).
zh_cn: 选择坐标基于显示(或窗口，如果不是全屏)的绝对大小，因此(0,0)总是屏幕(或窗口)的左上角。

source: The sequence ID is the name constant that you defined in the Asset Browser for the sequence.
zh_cn: 序列ID是您在Asset Browser中为序列定义的名称常量。

source: The sequence ID to create, as defined in the Asset Browser
zh_cn: 要创建的序列ID，如Asset Browser中定义的那样

source: The sequence index as defined in the asset browser.
zh_cn: 在资源浏览器中定义的序列索引。

source: The sequence instance struct to modify.
zh_cn: 要修改的序列实例结构。

source: The sequence object struct can then be used to create instances of the sequence on a room layer using the function layer_sequence_create().
zh_cn: 然后可以使用序列对象结构在房间层上使用layer_sequence_create()函数创建序列的实例。

source: The sequence object struct or ID to check for
zh_cn: 要检查的序列对象结构或ID

source: The sequence object struct or ID to destroy
zh_cn: 要销毁的序列对象结构或ID

source: The sequence object struct or ID to get the objects from.
zh_cn: 要从中获取对象的序列对象结构或ID。

source: The sequence will loop, with the playhead going back to the start when it reaches the end of the playback region.
zh_cn: 该序列将循环，当播放头到达播放区域的末尾时返回开始。

source: The sequence will loop, with the playhead reversing direction when it reaches the end of the playback region.
zh_cn: 该序列将循环，当播放头到达播放区域的末端时，它将反转方向。

source: The sequence will play frames in a decremental order from right to left
zh_cn: 该序列将以从右到左递减的顺序播放帧

source: The sequence will play frames in an incremental order from left to right
zh_cn: 序列将以从左到右递增的顺序播放帧

source: The sequence will play once then stop when finished.
zh_cn: 序列将播放一次，然后结束时停止。

source: The setting of the config value.
zh_cn: 配置值的设置。

source: The shader constant to get the handle of (a string).
zh_cn: 获取着色器常量的句柄(字符串)。

source: The shader index to assign to the layer
zh_cn: 要分配给图层的着色器索引

source: The shader must have been created previously in the Asset Browser and the shader index (the name of the shader resource) is then passed to this function.
zh_cn: 着色器必须已经在资源浏览器中创建，然后着色器索引(着色器资源的名称)被传递给此函数。

source: The shader sampler to get the handle of (a string).
zh_cn: 获取着色采样器的句柄(字符串)。

source: The shader to check.
zh_cn: 要检查的着色器。

source: The shader will also affect any other graphic elements drawn on that layer, like sprite assets or tile maps.
zh_cn: 着色器还会影响绘制在该层上的任何其他图形元素，如精灵资源或贴图。

source: The shape of the region.
zh_cn: 区域的形状。

source: The shape to choose.
zh_cn: 要选择的形状。

source: The single colour to make the particle type.
zh_cn: 制作粒子类型的单一颜色。

source: The size (in bytes) of the buffer.
zh_cn: 缓冲区的大小(以字节为单位)。

source: The size (in bytes) of the data.
zh_cn: 数据的大小(以字节计)。

source: The size of the array to create.
zh_cn: 要创建的数组的大小。

source: The size of the buffer (in bytes) that you wish to fill.
zh_cn: 希望填充的缓冲区大小(以字节为单位)。

source: The size of the buffer area to compress (in bytes).
zh_cn: 要压缩的缓冲区大小(以字节为单位)。

source: The size of the buffer area to load (in bytes).
zh_cn: 要加载的缓冲区大小(以字节为单位)。

source: The size of the buffer area to save (in bytes).
zh_cn: 要保存的缓冲区大小(以字节为单位)。

source: The size of the buffer.
zh_cn: 缓冲区的大小。

source: The size of the data to copy (in bytes).
zh_cn: 要复制的数据大小(以字节为单位)。

source: The size of the effect.
zh_cn: 效果的大小。

source: The size of the font - points for Web Fonts, pixels for file fonts.
zh_cn: 网页字体的字体大小，文件字体的像素。

source: The size of the step (which is how many pixels the instance should move each step) is indicated by the stepsize, and if the instance is already at the position it will stop and not move any further, contrary to other, simpler functions like move_towards_point().
zh_cn: 步长的大小(即实例每步应该移动多少像素)由步长指示，如果实例已经在该位置，它将停止，不再移动，这与其他更简单的函数(如move _ towards _ point()相反。

source: The sleep margin value is the main timing method
zh_cn: 睡眠裕度值是主要的计时方法

source: The slice will be repeated
zh_cn: 切片将被重复

source: The slice will be repeated by mirroring
zh_cn: 切片将通过镜像进行重复

source: The slice will be stretched
zh_cn: 切片将被拉伸

source: The slice will not appear at all
zh_cn: 切片根本不会出现

source: The slice will not be stretched or repeated, resulting in a blank area after it
zh_cn: 切片将不会被拉伸或重复，从而在其后面产生一个空白区域

source: The slot name (a string) to get the attachment of.
zh_cn: 要获取附件的插槽名称(字符串)。

source: The slot name to check, a string
zh_cn: 要检查的插槽名称，字符串

source: The slot name to set, a string
zh_cn: 要设置的槽位名称，字符串

source: The sort type (true for ascending or false for descending) or a function reference to use for sorting.
zh_cn: 排序类型（升序为 true，降序为 false）或使用函数引用用于排序。

source: The sound can either be a referenced from index for an individual sound being played which has been stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions, or an actual sound asset from the Asset Browser.
zh_cn: 声音可以是正在播放的单个声音的索引引用，该索引在使用audio_play_sound()或audio_play_sound_at()函数时已存储在变量中，也可以是资源浏览器中的实际声音资源。

source: The sound can either be a single instance of a sound (the index for individual sounds being played can be stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions) or a sound asset, in which case all instances of the given sound will be checked and if any of them are paused the function will return true otherwise it will return false.
zh_cn: 声音可以是声音的单个实例(当使用audio_play_sound()或audio_play_sound_at()函数时，正在播放的单个声音的索引可以存储在一个变量中)，也可以是声音资源，在这种情况下，将检查给定声音的所有实例，如果其中任何一个实例被暂停，此函数将返回true，否则将返回false。

source: The sound can either be a single instance of a sound (the index for individual sounds being played can be stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions) or a sound asset, in which case all instances of the given sound will be checked and if any of them are playing the function will return true otherwise it will return false.
zh_cn: 声音可以是声音的单个实例(当使用audio_play_sound()或audio_play_sound_at()函数时，正在播放的单个声音的索引可以存储在一个变量中)或声音资源，在这种情况下，给定声音的所有实例都将被检查，如果其中任何一个正在播放此函数将返回true，否则将返回false。

source: The sound can either be a single instance of a sound (the index for individual sounds being played can be stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions) or a sound asset, in which case all instances of the given sound will be paused.
zh_cn: 声音可以是声音的单个实例(当使用audio_play_sound()或audio_play_sound_at()函数时，播放的单个声音的索引可以存储在一个变量中)或声音资源，在这种情况下，给定声音的所有实例都将暂停。

source: The sound can either be a single instance of a sound (the index for individual sounds being played can be stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions) or a sound asset, in which case all instances of the given sound will be re-started.
zh_cn: 声音可以是声音的单个实例(当使用audio_play_sound()或audio_play_sound_at()函数时，正在播放的各个声音的索引可以存储在一个变量中)，也可以是声音资源，在这种情况下，给定声音的所有实例都将重新开始。

source: The sound can either be a single instance of a sound (the index for individual sounds being played can be stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions) or a sound asset, in which case all instances of the given sound will be stopped.
zh_cn: 声音可以是声音的单个实例(当使用audio_play_sound()或audio_play_sound_at()函数时，正在播放的各个声音的索引可以存储在一个变量中)，也可以是声音资源，在这种情况下，给定声音的所有实例都将停止。

source: The sound can either be a single instance of a sound (the index for individual sounds being played can be stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions) or a sound asset.
zh_cn: 声音可以是声音的单个实例(当使用audio_play_sound()或audio_play_sound_at()函数时，正在播放的各个声音的索引可以存储在一个变量中)，也可以是声音资源。

source: The sound can either be one referenced from an index for an individual sound being played which has been stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions, or an actual sound asset from the Asset Browser.
zh_cn: 声音可以是从正在播放的单个声音的索引中引用的声音，该索引在使用audio_play_sound()或audio_play_sound_at()函数时已存储在变量中，也可以是来自资源浏览器的实际声音资源。

source: The sound can only be a single instance of a sound (the index for individual sounds being played can be stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions).
zh_cn: 声音只能是声音的单个实例(当使用audio_play_sound()或audio_play_sound_at()函数时，正在播放的单个声音的索引可以存储在一个变量中)。

source: The sound index to be assigned to the group.
zh_cn: 要分配给组的声音索引。

source: The sound to check can either be a single instance of a sound (the index for individual sounds being played can be stored in a variable when using the audio_play_sound() or audio_play_sound_at() functions) or a sound asset.
zh_cn: 要检查的声音可以是声音的单个实例(当使用audio_play_sound()或audio_play_sound_at()函数时，播放的单个声音的索引可以存储在变量中)或声音资源。

source: The sound will loop when played.
zh_cn: 播放时声音会循环播放。

source: The sound will only play once then stop.
zh_cn: 声音只会播放一次，然后停止。

source: The space between each letter, 0 meaning the right of one letter just touches the left of the next one.
zh_cn: 每个字母之间的空间，0表示一个字母的右边刚好碰到下一个字母的左边。

source: The space to leave between each letter.
zh_cn: 每个字母之间的间隔。

source: The specific event constant or value, if one is necessary (otherwise, just use 0).
zh_cn: 特定的事件常量或值(如果有必要，则使用0)。

source: The specific event, if one is necessary (otherwise, just use 0).
zh_cn: 特定事件，如果需要的话(否则，使用0)。

source: The specific file attribute to look for.
zh_cn: 要查找的特定文件属性。

source: The specified name must include the full path, not a relative path and by default you cannot access any directories from out-with the game bundle as all games are sandboxed (see the section on the File System for more information).
zh_cn: 指定的名称必须包括完整路径，而不是相对路径，并且默认情况下，您不能从游戏捆绑包之外访问任何目录，因为所有游戏都是沙盒化的(有关更多信息，请参见文件系统一节)。

source: The speed (in inches per second) to set for flick gesture event detection.
zh_cn: 为笔势事件检测设置的速度(以英寸/秒为单位)。

source: The speed (number of pixels per game frame) that the view should move on the horizontal (x) axis
zh_cn: 视图应该在水平(x)轴上移动的速度(每个游戏帧的像素数)

source: The speed (number of pixels per game frame) that the view should move on the vertical (y) axis
zh_cn: 视图应该在垂直(y)轴上移动的速度(每个游戏帧的像素数)

source: The speed factor of the point (default value is 100).
zh_cn: 点的速度系数(默认值为100)。

source: The speed factor of the point.
zh_cn: 点的速度乘数。

source: The speed is calculated as pixels per step and can be set to "-1" to make the camera move instantly, but if the camera is not set to follow any instance then the values set here will have no visible effect.
zh_cn: 速度以每步像素计算，可以设置为"-1"以使相机立即移动，但如果相机没有设置为跟随任何实例，则此处设置的值将没有可见效果。

source: The speed is measured in inches per second and has a default value of 2.0.
zh_cn: 速度以英寸/秒为单位，默认值为2.0。

source: The speed multiplier/value to use for the element
zh_cn: 用于元素的速度乘数/值

source: The speed of which to follow the path in pixels per step, negative meaning going backwards.
zh_cn: 沿路径移动的速度，单位为每帧像素，负值表示后退。

source: The speed scale to use (a multiplier), default is 1
zh_cn: 要使用的速度缩放(乘数)，默认为1

source: The speed the instance moves in pixels per step.
zh_cn: 实例每步移动的像素速度。

source: The speed to move at in pixels per step.
zh_cn: 以像素/步为单位的移动速度。

source: The speed value given is a multiplier, with 1 being the default value, and setting it to 0.5 will half the animation speed - as set in the Sprite Editor or Image Editor- while setting it to 2 will double it.
zh_cn: 给定的速度值是一个乘数，1是默认值，设置为0.5将使动画速度减半(就像在精灵编辑器或图像编辑器中设置的那样)，而设置为2将使动画速度翻倍。

source: The sprite index of the Spine skeletal animation to get the data from.
zh_cn: Spine骨骼动画的精灵索引来获取数据。

source: The sprite index of the Spine skeletal animation to get the list from.
zh_cn: 用于获取列表的Spine骨骼动画的精灵索引。

source: The sprite index of the sprite to use for the background element
zh_cn: 用于背景元素的精灵的精灵索引

source: The sprite index to be used
zh_cn: 要使用的精灵索引

source: The sprite index to fetch
zh_cn: 要提取的sprite索引

source: The sprite must have been added at runtime (you cannot save sprites added through the IDE) and the file must be saved with a *.png extension.
zh_cn: 精灵必须在运行时添加(你不能保存通过IDE添加的精灵)，文件必须以*.png扩展名保存。

source: The sprite that you are setting the alpha of cannot be a permanent resource, nor can the sprite you use to set the alpha, as this will give an error.
zh_cn: 您正在设置alpha的sprite不能是永久资源，您用来设置alpha的sprite也不能是永久资源，因为这将导致错误。

source: The sprite to add a font based on.
zh_cn: 在精灵的基础上添加字体。

source: The sprite to assign to the object.
zh_cn: 要分配给对象的精灵。

source: The sprite to be copied from.
zh_cn: 要复制的精灵。

source: The sprite to use for each particle.
zh_cn: 用于每个粒子的精灵。

source: The sprite_index to get the attachment image from.
zh_cn: 从中获取附件图像的sprite_index。

source: The stack frame that the exception was generated from.
zh_cn: 从中生成异常的堆栈帧。

source: The start alpha of the particle.
zh_cn: 粒子的起始。

source: The start button (this is the "options" button on a PS4 controller)
zh_cn: 开始按钮(PS4控制器上的"选项"按钮)

source: The start of the buffer
zh_cn: 缓冲区开始

source: The starting alpha of the particle.
zh_cn: 粒子的起始alpha。

source: The starting index value to get the leaderboard data from.
zh_cn: 获取排行榜数据的起始索引值。

source: The starting position to search from.
zh_cn: 要搜索的起始位置。

source: The starting vertex.
zh_cn: 起始顶点。

source: The starting x position within the surface.
zh_cn: 表面内的起始x位置。

source: The starting y position within the surface.
zh_cn: 表面内y的起始位置。

source: The stem of the arrow is drawn along these points with the actual arrow head being drawn at the end, where the size of the arrowhead is defined by the argument "size" and is calculated as being part of the stem so that the end point is always aligned with the position defined by x2,y2.
zh_cn: 箭头的杆沿这些点绘制，实际的箭头头被绘制在末端，箭头的大小由参数"size"定义，并被计算为杆的一部分，因此终点总是与由x2,y2定义的位置对齐。

source: The stepsize is also the distance "ahead" that the object will check each step for a collision, and you can choose whether the instance stops at a collision with an object or instance of your choice.
zh_cn: 步长也是对象将检查每一步的碰撞的"前方"距离，并且您可以选择实例是否在与您选择的对象或实例发生碰撞时停止。

source: The stepsize is also the distance "ahead" that the object will check each step for a collision, and you can choose whether the instance stops at a collision with any instance or only those that are flagged as solid.
zh_cn: 步长也是对象将检查每一步的碰撞的"前方"距离，并且您可以选择实例是在与任何实例发生碰撞时停止，还是仅停止那些标记为实体的实例。

source: The stretch toggle, which can be true or false
zh_cn: 拉伸切换，可为 true 或 false

source: The string (name) to attribute the score to
zh_cn: 得分所属的字符串(名称)

source: The string containing all the ini information.
zh_cn: 包含所有ini信息的字符串。

source: The string should be correctly formatted as an ini file (ie: with sections, line breaks keys and values) otherwise the ini file will not be created correctly.
zh_cn: 字符串应该被正确地格式化为一个ini文件(即:包含节、换行符、键和值)，否则ini文件将不能被正确地创建。

source: The string should contain all the information that you need to save for your game as you can only store one single "data blob" to the cloud, and running this function again will overwrite any previously stored values (as will using the cloud_file_save() function).
zh_cn: 字符串应该包含你需要为你的游戏保存的所有信息，因为你只能将一个"数据包"存储到云端，再次运行此函数将覆盖所有之前存储的值(如使用cloud_file_save()函数)。

source: The string to be converted to a real value.
zh_cn: 要转换为实数值的字符串。

source: The string to be copied.
zh_cn: 要复制的字符串。
